# Logistic Regression 
### The logistic regression is used for classification problems. The attempts to explain this technique normally starts with an explanation of why the response of a linear regression can't be used estimate a quantitative response. 

### To explain the logistic regression we will use a dataset that shows the credit informaiton for a group of poeple.  We will use this information to explain what are the probabilities of a person getting a fault in his credit in base of other parameters presents in the dataset.

In [28]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d import Axes3D

#Lets read our database and take a look on the variables
default_df = pd.read_csv("/Users/ness/Projects/DataSources/Default.csv")
default_df.head()

   Unnamed: 0 default student      balance        income
0           1      No      No   729.526495  44361.625074
1           2      No     Yes   817.180407  12106.134700
2           3      No      No  1073.549164  31767.138947
3           4      No      No   529.250605  35704.493935
4           5      No      No   785.655883  38463.495879

In [29]:
#We can check how the data looks for people with debt
default_df[default_df["default"]=="Yes"].head()

     Unnamed: 0 default student      balance        income
136         137     Yes     Yes  1486.998122  17854.397028
173         174     Yes     Yes  2205.799521  14271.492253
201         202     Yes     Yes  1774.694223  20359.506086
206         207     Yes      No  1889.599190  48956.171589
209         210     Yes     Yes  1899.390626  20655.200003

In [30]:
#Lets create a plot showing how people
#First lets subsitute the Yes/No values for 1/0
default_df["default_num"] =
default_df.head()

   Unnamed: 0 default student      balance        income
0           1      No      No   729.526495  44361.625074
1           2      No     Yes   817.180407  12106.134700
2           3      No      No  1073.549164  31767.138947
3           4      No      No   529.250605  35704.493935
4           5      No      No   785.655883  38463.495879